---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionLAngle.BoltSpacing2LongerFlange
source: html/14891bd4-3eb9-4548-d199-664befb91072.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionLAngle.BoltSpacing2LongerFlange Property

Standard bolt spacing second row in the longer flange, in. (mm)

## Syntax (C#)
```csharp
public double BoltSpacing2LongerFlange { get; set; }
```